[{"model":"minutetalk.Channel","pk":15,"fields" : {"title":"MCDO","description":"McDonald's is an American fast food company, founded in 1980 as a restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States.","channel_type":8}},
{"model":"minutetalk.Channel","pk":16,"fields" : {"title":"BPI","description":"Bank of the Philippine Islands is the oldest bank in the Philippines still in operation. It is the country's third largest bank in terms of assets, the country's second largest bank in terms of market capitalization, and the country's most profitable bank.","channel_type":8}},
{"model":"minutetalk.Channel","pk":17,"fields" : {"title":"CHATIME","description":"Chatime is a Taiwanese global franchise teahouse chain based in Taiwan. It operates 1,002 outlets in 30 countries. In 2006, it opened its first store outside of Taiwan in California, and it has since expanded to China (PRC), Malaysia, Canada, Indonesia, the Philippines, Cambodia, Thailand, Australia, New Zealand, India, Dubai, Japan and Korea, among others. Its expansion and growth model is through franchising.","channel_type":8}},
{"model":"minutetalk.Channel","pk":18,"fields" : {"title":"FIBA","description":"The International Basketball Federation, more commonly known as FIBA, FIBA World, or FIBA International, from its French name Fédération internationale de basket-ball, is an association of national organizations which governs international competition in basketball. Originally known as the Fédération internationale de basket-ball amateur (hence FIBA), in 1989 it dropped the word amateur from its official name but retained the acronym; the BA now represents the first two letters of basketball.","channel_type":8}},
{"model":"minutetalk.Channel","pk":19,"fields" : {"title":"CHANNELFIX","description":"www.ChannelFix.com is the world's first professional e-league rewarding content creators through competition with user-generated-video in contests for global ranking and prizes.","channel_type":8}},
{"model":"minutetalk.Channel","pk":20,"fields" : {"title":"GIVE UP TOMORROW","description":"Give Up Tomorrow looks intimately at the case of Paco Larrañaga, a student accused of killing two sisters in July 1997. In a way that is both specific to the country and disquietingly universal, the film exposes a Kafkaesque extravaganza populated by flamboyantly crooked public officials, cops on the take, and a frenzied legal and media circus. Give Up Tomorrow is also an intimate family drama focused on the near mythic struggle of two angry, sorrowful mothers who have dedicated more than a decade to executing or saving one young man.","channel_type":8}},
{"model":"minutetalk.Channel","pk":21,"fields" : {"title":"NATIONAL GEOGRAPHIC","description":"National Geographic is an American digital cable and satellite television network that is owned by National Geographic Partners, majority-owned by 21st Century Fox with the remainder owned by the National Geographic Society. The flagship channel airs non-fiction television programs produced by National Geographic and other production companies.","channel_type":8}},
{"model":"minutetalk.Channel","pk":22,"fields" : {"title":"BIG BAD WOLF","description":"It's the brainchild of BookXcess leads Andrew Yap and Jacqueline Ng, whose main mission is to extend the doors of opportunity to book readers and book lovers who normally couldn't afford to buy one.","channel_type":8}}]